upstream/OpenFOAM-v2606/tutorials/incompressible/pimpleFoam/LES/NACA4412/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.0025;

writeControl    timeStep;

writeInterval   400;

purgeWrite      1;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// user-defined variables
tStartAvg       20;

functions
{
    #include "volFields"
    #include "wallFields"
    #include "fieldAverage"
    #include "forceCoeffs"
    #include "columnAverage"
    #include "sampleDict"
}

// ************************************************************************* //
